# Mission 1

Affiche les informations suivantes pour ce dataset : http://bit.ly/movieusers
- les 5 dernières lignes
- les 5 premières lignes
- Le type de chaque colonne

In [0]:
import pandas as pd
url = "https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/u.user"
df = pd.read_csv(url, sep="|", header = None)

df.head(5)

   0   1  2           3      4
0  1  24  M  technician  85711
1  2  53  F       other  94043
2  3  23  M      writer  32067
3  4  24  M  technician  43537
4  5  33  F       other  15213

In [0]:
df.tail()

       0   1  2              3      4
938  939  26  F        student  33319
939  940  32  M  administrator  02215
940  941  20  M        student  97229
941  942  48  F      librarian  78209
942  943  22  M        student  77841

In [0]:
df.columns = ['ID', 'Age', 'Gender', 'Position', 'User_no']

df.dtypes

ID           int64
Age          int64
Gender      object
Position    object
User_no     object
dtype: object

# Mission 2

Affiche les 10 premières lignes du fichier ci-après : http://bit.ly/drinksbycountry

In [0]:
url1 = "https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/drinks.csv"

df1 = pd.read_csv(url1, sep=",")
#df1 = pd.read_csv(url1, sep=",", index_col = "country") another type to mention index column
df1.head(10)

             country  ...      continent
0        Afghanistan  ...           Asia
1            Albania  ...         Europe
2            Algeria  ...         Africa
3            Andorra  ...         Europe
4             Angola  ...         Africa
5  Antigua & Barbuda  ...  North America
6          Argentina  ...  South America
7            Armenia  ...         Europe
8          Australia  ...        Oceania
9            Austria  ...         Europe

[10 rows x 6 columns]

Ensuite met la colonne country en index du dataframe au moment de sa lecture

In [0]:
#df2 = df1.set_index('country')
df2 = pd.read_csv(url1, sep=",", index_col = "country") 
df2.head()

             beer_servings  ...  continent
country                     ...
Afghanistan              0  ...       Asia
Albania                 89  ...     Europe
Algeria                 25  ...     Africa
Andorra                245  ...     Europe
Angola                 217  ...     Africa

[5 rows x 5 columns]

# Mission 3

Accède aux valeurs de la ligne (la valeur de l'index) **Zimbabwe**

In [0]:
country_value = df2.loc[["Zimbabwe"]]
country_value

          beer_servings  ...  continent
country                  ...
Zimbabwe             64  ...     Africa

[1 rows x 5 columns]

# Mision 4

Affiche uniquement la valeur du continent pour le pays **Zimbabwe**

In [0]:
country_value1 = df2.loc[["Zimbabwe"], ["continent"]]
country_value1

         continent
country
Zimbabwe    Africa

# Mission 5

Renomme les colonnes du dataset ci-après http://bit.ly/uforeports en français, avec 2 méthodes différentes :
- Directement lors de la lecture du fichier
- Après avoir crée le dataframe

In [0]:
url2 = "https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/ufo.csv"

df3 = pd.read_csv(url2, sep = ",",skiprows=1, names = ["Ville","colors Reporté","la_forme reporté", "état", "temp"]).head(3)
df3

         Ville colors Reporté la_forme reporté état             temp
0       Ithaca            NaN         TRIANGLE   NY   6/1/1930 22:00
1  Willingboro            NaN            OTHER   NJ  6/30/1930 20:00
2      Holyoke            NaN             OVAL   CO  2/15/1931 14:00

In [0]:
df4 = pd.read_csv(url2, sep=",").head(3)

df4.columns = ["Ville","colors Reporté","la_forme reporté", "état", "temp"]

df4

         Ville colors Reporté la_forme reporté état             temp
0       Ithaca            NaN         TRIANGLE   NY   6/1/1930 22:00
1  Willingboro            NaN            OTHER   NJ  6/30/1930 20:00
2      Holyoke            NaN             OVAL   CO  2/15/1931 14:00

# Mission 6

Sélectionne les 3 premières lignes et toutes les colonnes du dataframe avec iloc

In [0]:
df4.iloc[:3]

         Ville colors Reporté la_forme reporté état             temp
0       Ithaca            NaN         TRIANGLE   NY   6/1/1930 22:00
1  Willingboro            NaN            OTHER   NJ  6/30/1930 20:00
2      Holyoke            NaN             OVAL   CO  2/15/1931 14:00

# Mission 7

Fait en sorte d'obtenir le même résultat que la mission 6 avec loc

In [0]:
df4.loc[:3]

         Ville colors Reporté la_forme reporté état             temp
0       Ithaca            NaN         TRIANGLE   NY   6/1/1930 22:00
1  Willingboro            NaN            OTHER   NJ  6/30/1930 20:00
2      Holyoke            NaN             OVAL   CO  2/15/1931 14:00